_Rarzrabotki/Rarus/USO2/Documents/УСОERP_РасходМатериаловВСтроительстве.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_РасходМатериаловВСтроительстве</Name>
			<Comment>Расход материалов в строительстве</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УСОERP_РасходМатериаловВСтроительстве</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ВидыОперацийРасходаМатериаловВСтроительстве</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСПоставщиками</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПланов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУтверждения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УСОERP_УтверждениеКалендарногоПланаГрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаОбъема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УСОERP_ВидыОперацийРасходаМатериаловВСтроительстве.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УСОERP_ВидыОперацийРасходаМатериаловВСтроительстве</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СобственныеМатериалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатериалыПереданныеСубподрядчику</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_РасходМатериаловВСтроительстве/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстыЗапроса.Добавить(ТекстЗапросаТаблицаРасходМатериалов(),	"ТаблицаРасходМатериаловВСтроительстве");

	Запрос.Текст = "";
	Для Каждого ТекстЗапроса из ТекстыЗапроса Цикл
		Запрос.Текст = Запрос.Текст + ТекстЗапроса.Значение;
	КонецЦикла;
	
	////////////////////////////////////////////////////////////////////////////
	// Выполним запрос
	
	Результат = Запрос.ВыполнитьПакет();
	
	////////////////////////////////////////////////////////////////////////////
	// Поместим результаты запроса в дополнительные свойства
	
	Для Каждого ТекстЗапроса из ТекстыЗапроса Цикл
		ИмяТаблицы = ТекстЗапроса.Представление;
		Если Не ПустаяСтрока(ИмяТаблицы) Тогда
			Индекс = ТекстыЗапроса.Индекс(ТекстЗапроса);
			ДополнительныеСвойства.ТаблицыДляДвижений.Вставить(ИмяТаблицы, Результат[Индекс].Выгрузить());
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УСОERP_РасходМатериаловВСтроительстве.Ссылка,
	|	УСОERP_РасходМатериаловВСтроительстве.Дата КАК Период,
	|	УСОERP_РасходМатериаловВСтроительстве.Организация,
	|	УСОERP_РасходМатериаловВСтроительстве.ОбъектСтроительства,
	|	УСОERP_РасходМатериаловВСтроительстве.Партнер КАК Поставщик,
	|	ВЫБОР
	|		КОГДА УСОERP_РасходМатериаловВСтроительстве.ВидОперации = ЗНАЧЕНИЕ(Перечисление.УСОERP_ВидыОперацийРасходаМатериаловВСтроительстве.МатериалыПереданныеСубподрядчику)
	|			ТОГДА УСОERP_РасходМатериаловВСтроительстве.Контрагент
	|		ИНАЧЕ УСОERP_РасходМатериаловВСтроительстве.Подразделение
	|	КОНЕЦ КАК Исполнитель,
	|	УСОERP_РасходМатериаловВСтроительстве.Соглашение,
	|	УСОERP_РасходМатериаловВСтроительстве.Договор КАК Договор
	|ИЗ
	|	Документ.УСОERP_РасходМатериаловВСтроительстве КАК УСОERP_РасходМатериаловВСтроительстве
	|ГДЕ
	|	УСОERP_РасходМатериаловВСтроительстве.Ссылка = &Ссылка";
	
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	//
	Запрос.УстановитьПараметр("ОбъектСтроительства",	Реквизиты.ОбъектСтроительства);
	Запрос.УстановитьПараметр("Период",      			Реквизиты.Период);
	Запрос.УстановитьПараметр("Организация", 			Реквизиты.Организация);
	Запрос.УстановитьПараметр("Поставщик",	 			Реквизиты.Поставщик);
	Запрос.УстановитьПараметр("Соглашение",	 			Реквизиты.Соглашение);
	Запрос.УстановитьПараметр("Исполнитель", 			Реквизиты.Исполнитель);
	Запрос.УстановитьПараметр("Договор",	 			Реквизиты.Договор);
	
КонецПроцедуры

Функция ТекстЗапросаТаблицаРасходМатериалов()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	УСОERP_РасходМатериаловВСтроительствеМатериалы.Ссылка.Ссылка КАК Регистратор,
	|	УСОERP_РасходМатериаловВСтроительствеМатериалы.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	УСОERP_РасходМатериаловВСтроительствеМатериалы.Ссылка.Организация КАК Организация,
	|	УСОERP_РасходМатериаловВСтроительствеМатериалы.Ссылка.Склад КАК Склад,
	|	УСОERP_РасходМатериаловВСтроительствеМатериалы.Ссылка.ОбъектСтроительства КАК ОбъектСтроительства,
	|	ВЫБОР
	|		КОГДА УСОERP_РасходМатериаловВСтроительствеМатериалы.Работа.РаботаИсточник = ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
	|			ТОГДА УСОERP_РасходМатериаловВСтроительствеМатериалы.Работа
	|		ИНАЧЕ УСОERP_РасходМатериаловВСтроительствеМатериалы.Работа.РаботаИсточник
	|	КОНЕЦ КАК Работа,
	|	УСОERP_РасходМатериаловВСтроительствеМатериалы.Номенклатура КАК Номенклатура,
	|	УСОERP_РасходМатериаловВСтроительствеМатериалы.Характеристика КАК Характеристика,
	|	УСОERP_РасходМатериаловВСтроительствеМатериалы.Ссылка.Партнер КАК Партнер,
	|	ВЫБОР
	|		КОГДА УСОERP_РасходМатериаловВСтроительствеМатериалы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.УСОERP_ВидыОперацийРасходаМатериаловВСтроительстве.МатериалыПереданныеСубподрядчику)
	|			ТОГДА УСОERP_РасходМатериаловВСтроительствеМатериалы.Ссылка.Контрагент
	|		ИНАЧЕ УСОERP_РасходМатериаловВСтроительствеМатериалы.Ссылка.Подразделение
	|	КОНЕЦ КАК Исполнитель,
	|	СУММА(УСОERP_РасходМатериаловВСтроительствеМатериалы.Количество) КАК Количество,
	|	УСОERP_РасходМатериаловВСтроительствеМатериалы.Ссылка.ДатаНачала КАК ДатаНачала,
	|	УСОERP_РасходМатериаловВСтроительствеМатериалы.Ссылка.ДатаОкончания КАК ДатаОкончания,
	|	СУММА(УСОERP_РасходМатериаловВСтроительствеМатериалы.Объем) КАК Объем
	|ИЗ
	|	Документ.УСОERP_РасходМатериаловВСтроительстве.Материалы КАК УСОERP_РасходМатериаловВСтроительствеМатериалы
	|ГДЕ
	|	УСОERP_РасходМатериаловВСтроительствеМатериалы.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	УСОERP_РасходМатериаловВСтроительствеМатериалы.Номенклатура,
	|	ВЫБОР
	|		КОГДА УСОERP_РасходМатериаловВСтроительствеМатериалы.Работа.РаботаИсточник = ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
	|			ТОГДА УСОERP_РасходМатериаловВСтроительствеМатериалы.Работа
	|		ИНАЧЕ УСОERP_РасходМатериаловВСтроительствеМатериалы.Работа.РаботаИсточник
	|	КОНЕЦ,
	|	УСОERP_РасходМатериаловВСтроительствеМатериалы.Ссылка.Ссылка,
	|	УСОERP_РасходМатериаловВСтроительствеМатериалы.Характеристика,
	|	УСОERP_РасходМатериаловВСтроительствеМатериалы.Ссылка.Дата,
	|	УСОERP_РасходМатериаловВСтроительствеМатериалы.Ссылка.Организация,
	|	УСОERP_РасходМатериаловВСтроительствеМатериалы.Ссылка.Склад,
	|	УСОERP_РасходМатериаловВСтроительствеМатериалы.Ссылка.ОбъектСтроительства,
	|	УСОERP_РасходМатериаловВСтроительствеМатериалы.Ссылка.Партнер,
	|	ВЫБОР
	|		КОГДА УСОERP_РасходМатериаловВСтроительствеМатериалы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.УСОERP_ВидыОперацийРасходаМатериаловВСтроительстве.МатериалыПереданныеСубподрядчику)
	|			ТОГДА УСОERP_РасходМатериаловВСтроительствеМатериалы.Ссылка.Контрагент
	|		ИНАЧЕ УСОERP_РасходМатериаловВСтроительствеМатериалы.Ссылка.Подразделение
	|	КОНЕЦ,
	|	УСОERP_РасходМатериаловВСтроительствеМатериалы.Ссылка.ДатаНачала,
	|	УСОERP_РасходМатериаловВСтроительствеМатериалы.Ссылка.ДатаОкончания	
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|";

				   
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Отчеты

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	
КонецПроцедуры

#КонецОбласти

#Область СозданиеНаОсновании

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании,НастройкиФормы) Экспорт 	
		
	//	Документы.ВнутреннееПотреблениеТоваров.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
		
КонецПроцедуры

#КонецОбласти


#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
